In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.4)
Requirement already satisfied: six>=1.5 in c:\users\ses13\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

# What is a Series?

A Pandas Series is like a column in a table.


It is a one-dimensional array holding data of any type.

In [8]:
import pandas as pd # pd - alias for pandas

In [9]:
 y= [4,2,7,8,9,12]
a= pd.Series(y)
a

0     4
1     2
2     7
3     8
4     9
5    12
dtype: int64

In [10]:
print(type(a))

<class 'pandas.core.series.Series'>

In [11]:
y1 =['Gulshan','Raja','Mukesh','Shery','Rahul']
a1 = pd.Series(y1)
a1

0    Gulshan
1       Raja
2     Mukesh
3      Shery
4      Rahul
dtype: object

In [12]:
a1[2]

'Mukesh'

In [15]:
y2 =['Gulshan','Raja','Mukesh','Shery','Rahul']
a2= pd.Series(y2,index = [101,102,103,104,105])
a2

101    Gulshan
102       Raja
103     Mukesh
104      Shery
105      Rahul
dtype: object

In [30]:
a = (4,2,7,8,9,12)
b = pd.Series(y , index= ['a','b','c','d','e','f'], dtype='int')
b

a     4
b     2
c     7
d     8
e     9
f    12
dtype: int32

In [37]:
d = [4, 2, 7, 8, 9, 12]
e = pd.Series(d, index=['a', 'b', 'c', 'd', 'e', 'f'], dtype='float')
e

a     4.0
b     2.0
c     7.0
d     8.0
e     9.0
f    12.0
dtype: float64

In [25]:
y3 ={'name':['Gulshan','Raja','Mukesh'], 'age':[20,21,22]}
a3 = pd.Series(y3)
print(a3)
print(type(a3))

name    [Gulshan, Raja, Mukesh]
age                [20, 21, 22]
dtype: object
<class 'pandas.core.series.Series'>

In [26]:
s1 = pd.Series(10, index=[101,102,103,104,105])
s2 = pd.Series(20, index=[101,102,103])
print(s1)
print(s2)

101    10
102    10
103    10
104    10
105    10
dtype: int64
101    20
102    20
103    20
dtype: int64

In [38]:
print(s1+s2)

101    30.0
102    30.0
103    30.0
104     NaN
105     NaN
dtype: float64

In [43]:
s1 = s1.astype(float)
s2 = s2.astype(int)
print(s1)
print(s2)

101    10.0
102    10.0
103    10.0
104    10.0
105    10.0
dtype: float64
101    20
102    20
103    20
dtype: int32

# What is a DataFrame?

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

In [46]:
a = [ 4,2,5,1,7,4]
b =pd.DataFrame(a)
b

   0
0  4
1  2
2  5
3  1
4  7
5  4

In [47]:
y1 =['Gulshan','Raja','Mukesh','Shery','Rahul']
a1 = pd.DataFrame(y1)
a1

         0
0  Gulshan
1     Raja
2   Mukesh
3    Shery
4    Rahul

In [52]:
a = (4,2,7,8,9,12)
b = pd.DataFrame(y , index= ['a','b','c','d','e','f'], dtype='int')
b

    0
a   4
b   2
c   7
d   8
e   9
f  12

In [53]:
y3 ={'name':['Gulshan','Raja','Mukesh'], 'age':[20,21,22], 'mail':['gulshan@gmail.com','raja@gmail.com','mukesh@gmail.com']}
a3 = pd.DataFrame(y3)
a3

      name  age               mail
0  Gulshan   20  gulshan@gmail.com
1     Raja   21     raja@gmail.com
2   Mukesh   22   mukesh@gmail.com

In [56]:
a4 = pd.DataFrame(y3, columns=['name'])
a4

      name
0  Gulshan
1     Raja
2   Mukesh

In [59]:
a4 = pd.DataFrame(y3, columns=['name','age'])
a4

      name  age
0  Gulshan   20
1     Raja   21
2   Mukesh   22

In [60]:
a4 ['age']

0    20
1    21
2    22
Name: age, dtype: int64

In [63]:
a4['name'][0]

'Gulshan'

In [64]:
b = [[1,2,3,4,5,6],[76,78,89,96,56,25]]
b

[[1, 2, 3, 4, 5, 6], [76, 78, 89, 96, 56, 25]]

In [71]:
b2 = {'student': [ 'Raja','Muk','Smr','vin', ' sh'],'marks': [71,78,79,95,85]}
df = pd.DataFrame(b2)
df

  student  marks
0    Raja     71
1     Muk     78
2     Smr     79
3     vin     95
4      sh     85

In [75]:
df.shape

(5, 2)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   marks    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [78]:
y3 ={'name':['Gulshan','Raja','Mukesh'],
     'age':[20,21,22],
     'mail':['gulshan@gmail.com','raja@gmail.com','mukesh@gmail.com'],
     'address':['jharkhand','Bihar','up'],
     'phone No':[787457878,45474557,78954785],
     'Collage':['Dehradun','Patna','Kanpur'],
    }
a3 = pd.DataFrame(y3)
a3

      name  age               mail    address   phone No   Collage
0  Gulshan   20  gulshan@gmail.com  jharkhand  787457878  Dehradun
1     Raja   21     raja@gmail.com      Bihar   45474557     Patna
2   Mukesh   22   mukesh@gmail.com         up   78954785    Kanpur

In [79]:
a3.shape

(3, 6)

In [80]:
a3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      3 non-null      object
 1   age       3 non-null      int64
 2   mail      3 non-null      object
 3   address   3 non-null      object
 4   phone No  3 non-null      int64
 5   Collage   3 non-null      object
dtypes: int64(2), object(4)
memory usage: 272.0+ bytes

In [81]:
a3.describe()

        age      phone No
count   3.0  3.000000e+00
mean   21.0  3.039624e+08
std     1.0  4.190539e+08
min    20.0  4.547456e+07
25%    20.5  6.221467e+07
50%    21.0  7.895478e+07
75%    21.5  4.332063e+08
max    22.0  7.874579e+08

In [84]:
print (' no of rows are :', rows)

 no of rows are : 3

In [85]:
columns

6

In [87]:
# convert csv file 
a3.to_csv('dehradun.csv')

In [100]:
import pandas as pd 
a = pd.read_csv('iti.csv')
a

,State/District,ITI Count,Trade Count,Seat Count Current,Trainee Count
0,ANDAMAN AND NICOBAR ISLANDS,4,15.0,608,531.0
1,ANDHRA PRADESH,514,54.0,59716,NaN
2,ARUNACHAL PRADESH,7,28.0,964,487.0
3,ASSAM,42,38.0,4408,3500.0
4,BIHAR,1370,NaN,114672,NaN
5,CHANDIGARH,2,29.0,1012,910.0
6,CHHATTISGARH,233,51.0,26892,21996.0
7,DADRA AND NAGAR HAVELI,0,0.0,0,0.0
8,DAMAN AND DIU,0,0.0,0,NaN
9,DELHI,53,63.0,11844,8774.0
10,ASSAM,42,38.0,4408,3500.0

In [101]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State/District      11 non-null     object
 1   ITI Count           11 non-null     int64
 2   Trade Count         10 non-null     float64
 3   Seat Count Current  11 non-null     int64
 4   Trainee Count       8 non-null      float64
dtypes: float64(2), int64(2), object(1)
memory usage: 568.0+ bytes

In [102]:
a.shape

(11, 5)

In [103]:
a.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [104]:
a_1= a.dropna()
a_1

,State/District,ITI Count,Trade Count,Seat Count Current,Trainee Count
0,ANDAMAN AND NICOBAR ISLANDS,4,15.0,608,531.0
2,ARUNACHAL PRADESH,7,28.0,964,487.0
3,ASSAM,42,38.0,4408,3500.0
5,CHANDIGARH,2,29.0,1012,910.0
6,CHHATTISGARH,233,51.0,26892,21996.0
7,DADRA AND NAGAR HAVELI,0,0.0,0,0.0
9,DELHI,53,63.0,11844,8774.0
10,ASSAM,42,38.0,4408,3500.0

In [106]:
a_3 = a

In [107]:
a_3

,State/District,ITI Count,Trade Count,Seat Count Current,Trainee Count
0,ANDAMAN AND NICOBAR ISLANDS,4,15.0,608,531.0
1,ANDHRA PRADESH,514,54.0,59716,NaN
2,ARUNACHAL PRADESH,7,28.0,964,487.0
3,ASSAM,42,38.0,4408,3500.0
4,BIHAR,1370,NaN,114672,NaN
5,CHANDIGARH,2,29.0,1012,910.0
6,CHHATTISGARH,233,51.0,26892,21996.0
7,DADRA AND NAGAR HAVELI,0,0.0,0,0.0
8,DAMAN AND DIU,0,0.0,0,NaN
9,DELHI,53,63.0,11844,8774.0
10,ASSAM,42,38.0,4408,3500.0

In [108]:
a_3['Trade Count'].fillna(1010101)

0          15.0
1          54.0
2          28.0
3          38.0
4     1010101.0
5          29.0
6          51.0
7           0.0
8           0.0
9          63.0
10         38.0
Name: Trade Count, dtype: float64

In [109]:
a_3

,State/District,ITI Count,Trade Count,Seat Count Current,Trainee Count
0,ANDAMAN AND NICOBAR ISLANDS,4,15.0,608,531.0
1,ANDHRA PRADESH,514,54.0,59716,NaN
2,ARUNACHAL PRADESH,7,28.0,964,487.0
3,ASSAM,42,38.0,4408,3500.0
4,BIHAR,1370,NaN,114672,NaN
5,CHANDIGARH,2,29.0,1012,910.0
6,CHHATTISGARH,233,51.0,26892,21996.0
7,DADRA AND NAGAR HAVELI,0,0.0,0,0.0
8,DAMAN AND DIU,0,0.0,0,NaN
9,DELHI,53,63.0,11844,8774.0
10,ASSAM,42,38.0,4408,3500.0

In [115]:
x =a_3['Trade Count'].mean()
x

31.6

In [116]:
a_3['Trade Count'].fillna(x)

0     15.0
1     54.0
2     28.0
3     38.0
4     31.6
5     29.0
6     51.0
7      0.0
8      0.0
9     63.0
10    38.0
Name: Trade Count, dtype: float64

In [117]:
a_3

,State/District,ITI Count,Trade Count,Seat Count Current,Trainee Count
0,ANDAMAN AND NICOBAR ISLANDS,4,15.0,608,531.0
1,ANDHRA PRADESH,514,54.0,59716,NaN
2,ARUNACHAL PRADESH,7,28.0,964,487.0
3,ASSAM,42,38.0,4408,3500.0
4,BIHAR,1370,NaN,114672,NaN
5,CHANDIGARH,2,29.0,1012,910.0
6,CHHATTISGARH,233,51.0,26892,21996.0
7,DADRA AND NAGAR HAVELI,0,0.0,0,0.0
8,DAMAN AND DIU,0,0.0,0,NaN
9,DELHI,53,63.0,11844,8774.0
10,ASSAM,42,38.0,4408,3500.0

In [119]:
a_3['Trade Count'].mean()

31.6

In [120]:
a_3['Trade Count'].median()

33.5

In [121]:
a_3['Trade Count'].mode()

0     0.0
1    38.0
Name: Trade Count, dtype: float64

In [126]:
a_4 = a_3.index